tutorials/multiphaseReactiveTransport/interReactiveTransportFoam/poreSpaceReactiveTransport/0/Ca+2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ca+2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
	walls
    {
        type            globalConcentrationMixed;
    }

		porewalls
    {
        type            globalConcentrationMixed;
    }

	inlet
    {
        type            fixedValue;
       value           uniform 8.984e-4;
    }
	
	outlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type empty;

    }
}

// ************************************************************************* //
