tutorials/multiphaseReactiveTransport/interReactiveTransportFoam/poreSpaceReactiveTransport/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];


internalField   uniform 0;

boundaryField
{
	walls
    {
        type           fixedValue;
	value uniform -0.0076;
    }

		porewalls
    {
        type           fixedValue;
	value uniform -0.0076;
    }

	inlet
    {
	type            zeroGradient;
    }
	
	outlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type empty;

    }
}

// ************************************************************************* //
